---
kind: type
id: T:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus

An enumerated type containing possible results of the Path of Travel calculation.

## Syntax (C#)
```csharp
public enum PathOfTravelCalculationStatus
```